In [80]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

 ········

In [82]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [84]:
from sqlalchemy import text

with engine.connect() as connection:
    query = text('SELECT * FROM city')
    result = connection.execute(query)

result

In [86]:
row = result.first()

In [88]:
row # Check if the connection works

(1, 'A Coruña (La Coruña)', 87, datetime.datetime(2006, 2, 15, 4, 45, 25))

In [ ]:
# Okay it works

In [ ]:
# Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) 
# from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

# engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
# month: an integer representing the month for which rental data is to be retrieved.
# year: an integer representing the year for which rental data is to be retrieved.
# The function should execute a SQL query to retrieve the rental data for the specified month and year from 
# the rental table in the Sakila database, and return it as a pandas DataFrame.

In [60]:
def rentals_month (engine, month, year):
    """ Get the rental data for a given month and year. Return a dataframe."""
    query = f"""
    SELECT * FROM RENTAL
    WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};
    """

    return pd.read_sql(query, con=engine)

In [90]:
#check if it works 

df1 = rentals_month(engine, 8, 2005)
df1

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,10181,2005-08-01 00:00:44,3111,113,2005-08-04 19:33:44,1,2006-02-15 21:30:53
1,10182,2005-08-01 00:08:01,4112,578,2005-08-09 18:14:01,2,2006-02-15 21:30:53
2,10183,2005-08-01 00:08:01,4319,377,2005-08-09 20:41:01,1,2006-02-15 21:30:53
3,10184,2005-08-01 00:09:33,2785,77,2005-08-05 04:12:33,2,2006-02-15 21:30:53
4,10185,2005-08-01 00:12:11,1266,64,2005-08-03 03:03:11,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
5681,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
5682,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
5683,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
5684,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
5685,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

In [ ]:
# Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month 
# as input along with the month and year and returns a new DataFrame containing the number of rentals 
# made by each customer_id during the selected month and year.

# The function should also include the month and year as parameters and use them to name the new column according to the month and year, 
# for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

# Hint: Consider making use of pandas groupby()

In [92]:
def rental_count_month(df_rentals_month, month, year):
    """Take a dataframe with rental data for a given month and return a dataframe with the number of rentals made by each customer_id
    in that month."""
    # Ensure month is zero-padded for formatting
    month_str = str(month).zfill(2)
    
    # Define the new column name dynamically
    column_name = f"rentals_{month_str}_{year}"
    
    # Group by customer_id and count rentals
    rental_counts = df_rentals_month.groupby("customer_id")["rental_id"].count().reset_index()
    
    # Rename the count column
    rental_counts.rename(columns={"rental_id": column_name}, inplace=True)
    
    return rental_counts

In [94]:
# Check if it works 

df2 = rental_count_month(df1, 8, 2005)
df2

     customer_id  rentals_08_2005
0              1               11
1              2               11
2              3                7
3              4               11
4              5               13
..           ...              ...
594          595                8
595          596               13
596          597               12
597          598                5
598          599                7

[599 rows x 2 columns]

In [ ]:
# Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made 
# by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, 
# which is the difference between the number of rentals in the two months.

In [120]:

def compare_rentals(df_rcm_1, df_rcm_2):
    """Take 2 dataframes with number of rentals made by each customer in a given month and year.
    Return a combined dataframe with a 'difference' column, showing the difference between the number of rentals in the 2 months."""
    
    # Merge the two dataframes on 'customer_id'
    combined_rentals = pd.merge(df_rcm_1, df_rcm_2, on='customer_id', suffixes=('_month1', '_month2'))
    
    # Define the column names dynamically (based on the actual column names)
    rentals_column_month1 = df_rcm_1.columns[1]  # rentals column from the first dataframe 
    rentals_column_month2 = df_rcm_2.columns[1]  # rentals column from the second dataframe 
    
    # Calculate the difference in rentals
    combined_rentals['difference'] = combined_rentals[rentals_column_month2] - combined_rentals[rentals_column_month1]
    
    # Return the combined dataframe
    return combined_rentals

In [98]:
# Get 2 dataframes using rentals_month and rental_count_month 

df_may_05 = rentals_month(engine, 5, 2005)
df_count_may_05 = rental_count_month(df_may_05, 5, 2005)
df_count_may_05

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [100]:
df_june_05 = rentals_month(engine, 6, 2005)
df_count_june_05 = rental_count_month(df_june_05, 6, 2005)
df_count_june_05

     customer_id  rentals_06_2005
0              1                7
1              2                1
2              3                4
3              4                6
4              5                5
..           ...              ...
585          595                2
586          596                2
587          597                3
588          598                1
589          599                4

[590 rows x 2 columns]

In [118]:
df_may_june = compare_rentals(df_count_may_05, df_count_june_05)
df_may_june

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1                2                7           5
1              2                1                1           0
2              3                2                4           2
3              5                3                5           2
4              6                3                4           1
..           ...              ...              ...         ...
507          594                4                6           2
508          595                1                2           1
509          596                6                2          -4
510          597                2                3           1
511          599                1                4           3

[512 rows x 4 columns]